In [17]:
import numpy as np
import pandas as pd
import matplotlib as mlp

In [18]:
students = {
    101: ["Alice", "Math", 88],
    102: ["Bob", "Science", 75],
    103: ["Charlie", "English", 92],
    104: ["Diana", "History", 81]
}

In [19]:
df = pd.DataFrame.from_dict(students, orient='index')

In [20]:
df.columns = ["Name", "Subject", "Marks"]

In [21]:
df

        Name  Subject  Marks
101    Alice     Math     88
102      Bob  Science     75
103  Charlie  English     92
104    Diana  History     81

In [22]:
df.loc[102:104,['Name','Marks']]

        Name  Marks
102      Bob     75
103  Charlie     92
104    Diana     81

In [29]:
df.iloc[[1,3],[0,2]]

      Name  Marks
102    Bob     75
104  Diana     81